[
    {
      "Name": "cebbb5a2-47e2-4a79-9b61-a062d5c2805e",
      "Title": "InDesign CC 2019 New Features",
      "ReleaseDate": "2018-10-16T00:00:00Z",
      "UpdatedDate": "2018-10-16T00:00:00Z",
      "Level": "Intermediate",
      "ShortDescription": "InDesign CC 2019 introduces a number of small but powerful changes and enhancements to make professional layout artists’ work easier, faster, and more efficient. Learn all the new features and changes in the newest version of InDesign CC 2019.",
      "Description": "Like other recent new versions of InDesign, CC 2019 is a mature, already powerful product. In this course, InDesign CC 2019 New Features, you will learn about a number of small but powerful changes and enhancements to make professional layout artists’ work easier. First, you will explore the completely redesigned font family menu with powerful in-line buttons, the new properties panel, and the new content-aware fit option which brings the Adobe Sensei artificial intelligence from Photoshop CC into InDesign CC. Next, you will learn about the next generation of automatic layout adjustment and resizing assistance: the new zone-based adjust layout feature. Finally, you will discover the new ability to view and act on PDF comments directly within InDesign, the new paragraph style attribute, and several other new features in InDesign CC 2019. By the end of this course, you will be caught up on all the new changed features and up and running with the new InDesign CC 2019 in mere minutes. Software required: InDesign CC 2019.",
      "DurationInMilliseconds": 1518000,
      "HasTranscript": 0,
      "AuthorsFullnames": "Pariah Burke",
      "ImageUrl": "https://pluralsight.imgix.net/course-images/indesign-cc-2019-new-features-v1.jpg",
      "DefaultImageUrl": "https://s.pluralsight.com/mobile/creative-professional/intermediate.jpg",
      "IsStale": null,
      "CachedOn": null,
      "UrlSlug": "indesign-cc-2019-new-features"
    },
    {
      "Name": "5915e08e-827b-4c22-88c6-dfb889e5e7a1",
      "Title": "Secure Coding: Preventing Insufficient Logging and Monitoring",
      "ReleaseDate": "2018-07-25T00:00:00Z",
      "UpdatedDate": "2018-07-25T00:00:00Z",
      "Level": "Intermediate",
      "ShortDescription": "Most security breaches start with a single incident. This course will teach you how to set up correct logging and monitoring for your application, as well as what to log and what not to log in order to detect those incidents on time.",
      "Description": "It is extremely important for the security of your company to know what's currently happening to your application. This can be achieved by proper application logging and monitoring. In this course, Secure Coding: Preventing Insufficient Logging & Monitoring, you will learn what to think of when setting up logging and monitoring for applications. First, You will learn what is meant with the risk of insufficient logging and monitoring. Next, you'll explore what your application should and shouldn't log. Finally, you'll discover how to ensure and improve the quality of log files. When you're finished with this course, you'll have all the application logging and monitoring skills and knowledge needed to detect (future) security incidents on time.",
      "DurationInMilliseconds": 5025000,
      "HasTranscript": 0,
      "AuthorsFullnames": "Peter Mosmans",
      "ImageUrl": "https://pluralsight.imgix.net/course-images/secure-coding-preventing-insufficient-logging-monitoring-v1.png",
      "DefaultImageUrl": "https://s.pluralsight.com/mobile/security-professional/intermediate.jpg",
      "IsStale": null,
      "CachedOn": null,
      "UrlSlug": "secure-coding-preventing-insufficient-logging-monitoring"
    },
      {
      "Name": "8a28282d-c06d-4e1f-92fd-b9e0af6bd225",
      "Title": "Containerizing Angular Applications with Docker",
      "ReleaseDate": "2018-07-26T00:00:00Z",
      "UpdatedDate": "2018-07-26T00:00:00Z",
      "Level": "Intermediate",
      "ShortDescription": "Learn how to build and run your Angular application code using Docker containers. Explore how to write dockerfiles for custom images, leverage multi-stage dockerfiles, container orchestration with Docker Compose, and much more.",
      "Description": "The Angular CLI provides a great way to build and run Angular applications locally, but what do you do when you need to build Angular in another environment? How do you deploy your Angular application between development, staging/QA, and production environments while ensuring that everything works as planned? In this course, Containerizing Angular Applications with Docker, you'll explore the role that Docker containers can play in simplifying the process of building and deploying Angular applications. First, you'll learn about the role of images and containers, and image registries. Next, you'll discover how to write custom multi-stage Dockerfiles for building Angular code. Then, you'll delve into different server options such as nginx for running your Angular applications efficiently and consistently across environments. Finally, you'll explore how to orchestrate multiple containers using Docker Compose and .yml files. By the end of this course, you'll have the necessary knowledge to efficiently build and run Angular applications across multiple environments by utilizing Docker containers.",
      "DurationInMilliseconds": 6908000,
      "HasTranscript": 0,
      "AuthorsFullnames": "Dan Wahlin",
      "ImageUrl": "https://pluralsight.imgix.net/course-images/containerizing-angular-apps-docker-v1.png",
      "DefaultImageUrl": "https://s.pluralsight.com/mobile/software-development/intermediate.jpg",
      "IsStale": null,
      "CachedOn": "2018-07-27T10:24:19Z",
      "UrlSlug": "containerizing-angular-apps-docker"
    },
    {
      "Name": "7f9a2bbe-1cbb-4597-a954-a8205b1f28be",
      "Title": "Securing Angular Apps with OpenID and OAuth2",
      "ReleaseDate": "2018-07-27T00:00:00Z",
      "UpdatedDate": "2018-07-27T00:00:00Z",
      "Level": "Intermediate",
      "ShortDescription": "OpenID Connect and OAuth 2 allow your apps to use modern security protocols and to participate in a Single Sign-On (SSO) experience across multiple apps. This course will show you how to authenticate users and authorize access in your Angular apps.",
      "Description": "Securing your Angular apps with modern, interoperable security protocols helps you ensure your apps are secure, and that they can participate in a Single Sign-On (SSO) experience across multiple apps that use the same identity provider. In this course, Securing Angular Apps with OpenID and OAuth 2, you will learn how to apply the OpenID Connect and OAuth 2 protocols to authenticate users and authorize their access to functionality and data in your apps. First, you will explore the security fundamentals and concepts you need to be aware of for Angular apps. Next, you will discover how to connect to your OpenID Connect identity provider for authentication. Lastly, you will successfully use and manage your OAuth 2 access tokens for authorization. When you are finished with this course, you will have a solid foundation for building your Angular apps with robust security and done in a way that lets you integrate with any OpenID Connect and OAuth 2 identity provider.",
      "DurationInMilliseconds": 9047000,
      "HasTranscript": 0,
      "AuthorsFullnames": "Brian Noyes",
      "ImageUrl": "https://pluralsight.imgix.net/course-images/openid-and-oauth2-securing-angular-apps-v1.png",
      "DefaultImageUrl": "https://s.pluralsight.com/mobile/software-development/intermediate.jpg",
      "IsStale": null,
      "CachedOn": null,
      "UrlSlug": "openid-and-oauth2-securing-angular-apps"
    },
    {
      "Name": "02b07673-2ee8-4722-bfc9-01f9574054a1",
      "Title": "Swords and Shovels: Post Processing and Polish",
      "ReleaseDate": "2018-07-19T00:00:00Z",
      "UpdatedDate": "2018-07-19T00:00:00Z",
      "Level": "Intermediate",
      "ShortDescription": "Post processing is crucial for capturing art direction and bringing game worlds to life. In this course, you’ll learn how to work with the Post Processing Stack, create atmospheric FX, and establish a distinct sense of place.",
      "Description": "Post processing is crucial for capturing art direction and bringing game worlds to life. In this course, Swords and Shovels Post Processing and Polish you’ll learn how to work with the Post Processing Stack, create atmospheric FX and establish a distinct sense of place. First, you’ll access a level from the Swords and Shovels project and quickly cover project settings for maximizing quality, the photographic basis of post processing FX, installing the post processing stack, and working with post processing settings. Next, you'll begin adding lighting and particle-based atmospheric FX such as fog, water drips, and cave bats to your scene to add the more interesting look and feel to the level. Lastly, you’ll create a final polishing pass to ensure that we capture art direction and create a distinct sense of place. By the end of this course, you should have a firm grasp of how to create a distinctive look to your modular level. Software required: Unity.",
      "DurationInMilliseconds": 3242000,
      "HasTranscript": 0,
      "AuthorsFullnames": "Michael Baker",
      "ImageUrl": "https://pluralsight.imgix.net/course-images/swords-shovels-post-processing-polish-v1.png",
      "DefaultImageUrl": "https://s.pluralsight.com/mobile/creative-professional/intermediate.jpg",
      "IsStale": null,
      "CachedOn": "2018-07-23T05:39:06Z",
      "UrlSlug": "swords-shovels-post-processing-polish"
    },
    {
      "Name": "19716188-f694-4253-85cb-43de7ba6d54e",
      "Title": "Angular Fundamentals",
      "ReleaseDate": "2017-01-18T00:00:00Z",
      "UpdatedDate": "2018-07-03T00:00:00Z",
      "Level": "Intermediate",
      "ShortDescription": "This course will teach you the fundamentals of working with the latest version of Angular. You will learn everything you need to know to create complete applications including: components, services, directives, pipes, routing, HTTP, and even testing.",
      "Description": "Angular has become one of the most widely used web development frameworks. This course, Angular Fundamentals, will teach you the fundamentals of writing applications with Angular - whether or not you've had past experience with Angular 1. You will learn how to bootstrap an application and how to build pages and reusable elements using Angular Components and the new Angular syntax. You'll also learn the fundamentals of: routing, creating reusable services and dependency injection, building forms with validation, and communicating with the server using HTTP and observables. You'll even learn how to test all of this using unit tests and end-to-end UI tests. When you finish this course, you will have the fundamental knowledge necessary to create professional and personal websites using Angular.",
      "DurationInMilliseconds": 34517000,
      "HasTranscript": 1,
      "AuthorsFullnames": "Joe Eames|Jim Cooper",
      "ImageUrl": "https://pluralsight.imgix.net/course-images/angular-fundamentals-v1.jpg",
      "DefaultImageUrl": "https://s.pluralsight.com/mobile/software-development/intermediate.jpg",
      "IsStale": null,
      "CachedOn": null,
      "UrlSlug": "angular-fundamentals"
    }
  ]